import React, { Component } from 'react';
import { StyleSheet, ScrollView, View, Text, TouchableOpacity, Image,ImageBackground, Dimensions } from 'react-native';
import CustomButton from '../components/button'
import I18n from 'react-native-i18n';
const { width, height } = Dimensions.get('window')

const love = [ 
    " هل تفهَم كيف يكون هذا الشّعور : لست بـ حزين، فقط تشعر بالعُتمة في صدرك. هل تفهم كيف يكون المرء مُنطفئ؟"," القانون لا يحمي المغفلين والحـب لا يحمي المخلصين."," نحن قوم إذا أحببنا شخص بادلناه الموسيقى، و أحزاننا"," عندما تنتظر شخصاً ما لدرجة الجنون، فإنك حتماً ستفقد حلاوة لقائه بسبب إهماله."," اللهمّ قوني بك اذا انفلتَ صبري وضاقت نفسِي وسئمَت"," ما أصعب أن تتكلم بلا صوت، وأن تحيى كي تنتظر الموت، ما أصعب أن تشعر بالسأم، فترى كل من حولك عـدم، ويسودك إحساس الندم"," حين يشتد التعب بالعين؛ تُغلِق على نفسها من تلقاء نفسها .. كذلك نحن .. كذلك القلب"," كم هو مؤلم أن تضحك وعيناك تصرخ بالدموع، ولكن رائع أن تبتسم عندما ينتظر منك الآخرون البكاء."," لن أقبل أن أكون نجماً بائسا يُهرول خلف مجرّتك الذاتية"," مؤلم أن تجلس بين الناس تضحك وتبتسم وأنت تختنق، ولكن رائع أن تحتضر لتمنح الآخرين ضحكةً صافية وابتسامة مشجعة."," كم تمنيت أن تتحسن أحوالي وأنا السبب في أحوالي كم تمنيت أن يرتاح بالي وأنا الذي أشغل بالي يا حسرتي على كل دقيقة أمضيتها أقتل نفسي .. بيدي"," اليوم أنا بينكم، وغداً قد أرحل عنكم، فإن بقيت فلا تهجروني، وإن رحلت فلا تنسوني."," على الرغم من أنني غالبًا في قاع البؤس، هناك هدوء، انسجام نقي وموسيقا داخلي.”"," أعجب كيف لك هذه القدرة على أن تغيب تاركاً خلفك قلباً يذوب عشقاً ولوعةً في غيابك."," جعلت مني شخصًا لا يثق في أي حد، شخصًا أصبح قلبه ملئ بالخُذلان والخوف"," قُلوبٌ تَميلْ وقُربي إليها مِنَ المُستَحيلْ، لأنِّي جَريحْ وأشتاقُ يومًا لأنْ أستريحْ، فلا تَخدَعيني بِحُبٍّ جَديدْ لأنِّي أخافُ دَعيني بَعيدْ."," أن تحبني أنت مخير لا مجبر .أن تحترمني أنت مجبر لا مخير"," ما أكثر الذين يتوهمون أنهم يفهموننا، لأنهم وجدوا في بعضٍ من مظاهرنا شيئاً شبيهاً بما اختبروه مرّة في حياتهم، وليتهم يكتفون بادعائهم معرفة أسرارنا، تلك التي ذاتنا لا تدركها."," انك تكون شخص “حساس وبتاخد ع خاطرك بسرعه” دا ممكن يكون اسوء انواع الابتلاء"," كيف لقلبي أن يغفو والشوق يقتلني ويدفعني للقدوم اليك، الليل يخطو والعمر يكاد يدنو إلى شفا حفرة الرحيل، وأنا لا زلت طفلةً أحبو على طريق حبك، أطرق باب قلبك."," أحياناً يكون إكرام الحب دفنة		"," من السهل جداً أن يضحّي الشاب من أجل فتاة، ولكن الصعب أن تجد فتاة تستحق التضحية، لا تحزن إن خانتك فتاة، فهي كالطير يشرب من كل قناة."," أشتقنا لناس كانت سعادتنا ..كانت حياتنا .. كانت كل شئ"," ربي انزع من قلبي تلك الأشياء التي تؤلمني، فقد خاب الظن في الكثير، والظن بك لا يخيب."," تَعَود دائماً أن تَقُول يَا {رَب} بَدل أَن تَقُول يَا {لَيت} فَهُنَاك رَب قَادر عَلى تَحقيق كُل مَا تَمَنَيت"," تجمعنا الأيّام وتأخذنا الأحلام، نطير في فضاء الكون، ونحلّق بين ثنايا السّحاب، نضحك ونمرح ونحبّ ونعشق، وتأخذنا الأحلام."," سـ أبـتسم دائـمآ لـ عـزة نـفسي ولا أبـالي بـ أنـها سـ تـكون قـاتلتي يـومآ مـا"," ويأخذنا الكلام، حتّى يطلع فجر يومٍ جديد، لنحزم أمتعتنا ونطير من جديد، وتأخذنا الأحلام حتّى نستيقظ على واقع مرير، لنفتح أعيننا وكأنّنا في عالم جديد، وكأنّ الّذي عشناه مجرّد أحلام."," حب الرجل للمرأة #فطرة ؛ ولكن حمايتها و الحفاظ عليها #رجولة"," هذه الذّكريات تكاد تقتلنا، لا مفرّ من شاطئ الذّكريات؛ حيث قطعنا مسافات ومسافات كي نصله."," قال لها انتيّ اجمل نساء الكون فقالت له.. من اين تعرف نساء الكون"," إلى أين يسير بنا الطّريق؟ إلى بقايا مبعثرة؟ أم إلى صرخه مخنوقة؟ ورحلة مجهولة؟"," هنالك أشخاص تلتقي بهم صدفة فيصبحوا بتلك الصدفة أغلى الناس على قلبك"," ساعديني أيّتها الحياة ، إنّني فقيدة النّفس، نفسي أتدرين أنّها من رائحة اليأس، اليأس يتخلّلني في نفسي."," الحاجات المكتومه جوانا بقِت بتطلع علي شكل صداع ، قلة نوم ، سكوت ، ضلمه ، وحده ، عدم تركيز"," أما زلت منتظراً أحداقي؟ أما زلت تلتقط أوراقي؟ أتريد أن تجني أشواقي؟ اذهب الآن فقد أتعبَتني وأرهقَتني ذكرياتي."," الحوار كله مسألة وقت بس، وبعد كدة هتتعود وهتاخد كل حاجة بتحصل ببرود"," أما زلت منتظراً أحداقي؟ أما زلت تلتقط أوراقي؟ أتريد أن تجني أشواقي؟ اذهب الآن فقد أتعبَتني وأرهقَتني ذكرياتي."," ليست القوه فى قدرتك على التمسك بالأشياء بل فى قدرتك على التخلى عنها"," وقعدتنا ف اوضتنا لوحدنا وجع مايفهموش غير اللى جربه"," مؤلم أن تجلس بين الناس تضحك وتبتسم وأنت تختنق، ولكن رائع أن تحتضر لتمنح الآخرين ضحكةً صافية وابتسامة مشجعة."," أنا مبحبش الاكتئاب بس كل حاجه حواليا بقت دافع إني أقفل علي نفسي وأبعد عن كل الناس بشكل عام "," يدفعك الحنين أحيانا إلى البحث عن الدفء في كلماتهم القديمه"," سأختلـِس رآئـِحتك وَ أخبئهآ فـِي رِئتيّ لأتنفسـَك كـُلما رآودنـِي الشـَوق اليك" 
    ]

const forak = [
     "اللقاء ليس إلا بداية الفراق. ","فراق الأحباب سقام الألباب. ","من لاح له كمال الآخرة هان عليه فراق","الفراق هو الموت الصغير. ","لا خلود يُطفئ فواجع الفقد والفراق. ","الفراق هو الوجه الآخر للحب، والخيبة هي الوجه الآخر للعشق. ","كل آلام الفراق تنتهي لحظة تجدد اللقاء.  ","المحبة لا تعرف عُمقها إلا ساعة الفراق. ","إنَما ابتُليَ الخلق بالفراق لئلاَّ يكون لأحدٍ سكونٌ مع غيرِ الله تعالى."

    ]
    
const ghadr = [ 
    " يا تخليك قد كلامك، يا تخلي كلامك على قدك"," هتعرف الحقيقة وقت الضيقة."," متصاحبش صاحب فى داهية يوديك، وصاحب كلب فى شدة يحميك."," المشي البطال ياما بهدل أبطال"," من المؤسف حقّاً أن تبحث عن الصّدق في عصر الخيانة، وتبحث عن الحبّ في قلوب جبانة."," الدنيا دوامة ومفيش عوامة"," اصحاب الشدة اتنين واصحاب المصلحة ألفين."," حرك شفايفك عشان مش شايفكتكسب الناس بسهولة .. لو فيك من طباع الرجولة"," لو صاحبك خانك.. اعتبر أنّه قد مات.. أفضل من التفكير بأنّه خانك.. اعتبره قد مات."," من يولد يزحف .. لا يستطيع أن يطير"," ما أبشع أن تخون صديقا، ولكن الأبشع أن تجد الخيانة سهلة."," ما تبصش يا عبيط دى جاية بالتقسيط"," الكراهيّة لا تقتل سوى قلب صاحبها."," ياعم اصاحب مين دا عشري باع ابراهيم"," غدر الصديق.. إليك صديقي الخائن.. كنت أظن أن الصديق وقت الضيق كما يقال.. لكن إكتشفت أنه سبب الضيق لماذا.. لم أفعل له شيئاً أهكذا يرد الجميل."," توك توك يلمنا ولا كفيل يذلنا"," يخونُكَ من أَدى إِليك أمانةً.. فلم ترعهُ يوماً بقولٍ ولا فِعْلِ فَأَحْسِنْ إِلى من شِئْتَ في الأرضِ أو أسيءْ.. فإِنكَ تُجْزى حذوكَ النعلَ بالنعلِ."," امسك لسانك يعلى مكانك وخلي سكوتك يوجع أكتر من كلامك"," جرب صديقك قبل أن تثق به."," لو انت بابا في المجال، ف أنا أبقى جد العيال"," تصادق مع الذئاب.. على أن يكون فأسك مستعداً."," لو فاكر نفسك أحسن مني هخليك في يوم تيجي تقول لي علمني"," الصادقون في عواطفهم لا يبالون بالمظاهر."," السواقة فن مش عن عن"," ذكرى مؤلمة إذا عرفت أن صديقك وحبيبك خانك ذكرى مؤلمة إذا عرفت كم من الوقت المبذول للتفكير في هذا الصديق والحبيب الخائن."," لو عشت هذلك…. ولو مت الله يسهلك"," وكم من ندامة خلفتها وراء هذا الصديق، وكتبت من صميم فؤادي وصديد قلبي."," لو لعبت مع الديب استحمل .. التعذيب"," ليس من الصعب أن تضحي من أجل صديق، ولكن من الصعب أن تحب صديقاً يستحق التضحية."," ربنا اداني و عيون الناس مش سايباني"," لو مفيش حد بيغلط مكانوش حطوا فوق القلم أستيكة"," الصداقة والحب معناها الحقيقي."," اسأل عني هيقولولك حاجتين معروف بالاحترام ومالوش في الحرام"," تصلك الطعنات ممن كان يحمي ظهرك ويحرسة ممن كان في يوم يدعي الصداقة والاخوة"," حسدوا الصحاب علي لمتهم لحد ما بانو علي حقيقتهم ."," انا لسة بصحتى ويا مرحب باللي يجي على سكتي ."," الميكانيكا أداء مش شد أجزاء"," ناس منعرفهاش وبتشكر فينا وناس نعرفها بتتكلم علينا ."," أنا يوم ما أبيع.. مفيش ترجيع"," اضحك حتى لو مش بجد متخليش نفسك تصعب على حد ."," ناس منعرفهاش وبتشكر فينا وناس نعرفها بتتكلم علينا ."," يا ناس أنا مخي باظ.. هسيب التكنولوجيا وهركب ميكروباص"," على قد دماغك فكر وعلى قد دماغ اللى قدامك اتكلم ."," اللي كانوا تلاميذنا.. فاكرينّا عجزنا"," دنيا كلها تمثيل وصعب تلاقى حد أصيل ."," الرجولة فرص مش عجوة وقرص"," اصلها حكاية من أيام الجدود، عمر القطط ما تعلي علي الأسود ."," لو قلبك مات ماتجيش على اتنين إخوات"," اضحك حتى لو مش بجد متخليش نفسك تصعب على حد . فراق الحبيب يشيب الوليد ويُذيب الحديد. البعد جفاء."
    ]


class arabic extends Component {
    
    qoutes() {
        let array= []
        console.log(I18n.locale);
        if(I18n.locale == 'loveAr'){
           array = love
        }
        if(I18n.locale == 'forakAr'){
            array = forak
         }
         if(I18n.locale == 'ghadrAr'){
            array = ghadr
         }
         let counter = 0
        return array.map((data)=>{
            counter++
            return (
                <ScrollView>
                    
            <Text style={styles.text}>{counter} {data}</Text>
            <Text> </Text>
            </ScrollView>
            )
        
        }
    
    
        )
    }
    render() {
        
        return(
          
             <View>
              <Image style={styles.fixed} source={require('../imgs/book.jpg')}>

              </Image>
              <ScrollView >
              <Text></Text>
              {this.qoutes()}
              </ScrollView>
              </View>
             
        )
    }
}

const styles = StyleSheet.create({
    text: {
        color: "white",
        fontSize: 16,
        fontFamily:'Cairo-Regular',
        padding:5
    },
    fixed:{
        width: Dimensions.get("window").width,
    height: Dimensions.get("window").height, 
        zIndex: -1,
    position: "absolute",
    top: 0,
    left: 0,
    right: 0,
    bottom: 0
    }
});


export default arabic